package com.rm.promotion

import android.os.Bundle
import androidx.appcompat.app.AppCompatActivity
import com.rm.promotion.databinding.ActivityReprintBinding
import com.rm.promotion.util.PreferenceUtils
import com.rm.promotion.util.SunmiPrintHelper
import com.rm.qrgenerator.EncryptPromotionCode

class ReprintQRActivity : AppCompatActivity() {
    val print_size = 6
    val error_level = 3
    val width = intArrayOf(1, 1)
    val align = intArrayOf(0, 2)
    private lateinit var binding: ActivityReprintBinding
    override fun onCreate(savedInstanceState: Bundle?) {
        super.onCreate(savedInstanceState)
        binding = ActivityReprintBinding.inflate(layoutInflater)
        setContentView(binding.root)

        binding.let {
            it.btnPrint.setOnClickListener { view ->
                val data = mapOf(
                    "G95" to "CleanX GSH95",
                    "91" to "CleanX GASOLINE",
                    "E20" to "CleanX E20",
                    "E85" to "CleanX E85",
                    "G91" to "CleanX GSH91",
                    "B7" to "CleanX Diesel B7",
                    "B20" to "CleanX Diesel B20",
                    "D" to "CleanX Diesel",
                    "SB7" to "Super Power Diesel B7",
                    "SG95" to "Super Power GSH95"
                )

                val productId = it.productId.text.toString().trim()
                val strPrice = it.price.text.toString().trim()
                val price = strPrice.toDouble().toCurrency()
                val cashierName = it.cashierName.text.toString().trim()
                val sellDate = it.sellDate.text.toString().trim()
                val stationCode = it.stationCode.text.toString().trim()
                val promotionCode = it.promotionId.text.toString().trim()
                val promotionTotal = it.total.text.toString().trim()
                var promotionId = promotionCode
                when (promotionCode.length) {
                    1 -> promotionId = "00" + promotionCode
                    2 -> promotionId = "0" + promotionCode
                    3 -> promotionId = promotionCode
                }
                val finalPromotionTotal =
                    if (promotionTotal.length == 1) "0$promotionTotal" else promotionTotal
                val qrcode = getQRCode(promotionId, finalPromotionTotal, stationCode)
                val linkQR = qrcode.first
                val qrText = qrcode.second
                val productName = arrayOf(data.get(productId), price)
                val total = arrayOf("Total", price)
                val cash = arrayOf("เงินสด/อื่นๆ", price)

                SunmiPrintHelper.getInstance().setAlign(1)
                SunmiPrintHelper.getInstance().printTitle("\n\n" + getStationName(stationCode))
                SunmiPrintHelper.getInstance().printSubtitle(cashierName)
                SunmiPrintHelper.getInstance().printSubtitle("วันที่ขาย#" + sellDate)
                SunmiPrintHelper.getInstance().printSplit2()

                SunmiPrintHelper.getInstance().printTable(productName, width, align)
                SunmiPrintHelper.getInstance().printTable(total, width, align)
                SunmiPrintHelper.getInstance().printTable(cash, width, align)
                SunmiPrintHelper.getInstance().printSplit2()
                SunmiPrintHelper.getInstance().printSubtitle("1365 Contact Center")
                SunmiPrintHelper.getInstance().printSubtitle("==VAT INCLUDED==")
                SunmiPrintHelper.getInstance().printSubtitle("THANK YOU AND WELCOME")
                SunmiPrintHelper.getInstance().printSplitCut(this)

                SunmiPrintHelper.getInstance().setAlign(1)
                SunmiPrintHelper.getInstance()
                    .printTitle("แรง ลุ้น โชค\n" +
                            "ลุ้นรางวัลกว่า 14 ล้านบาท\n" +
                            "สแกนเลย !")
                SunmiPrintHelper.getInstance().printWithSize("เติมน้ำมันทุก 600 บาท รับสิทธิ์ชิงโชค 1 สิทธิ์ \n" +
                            "แรงกว่า! เมื่อเติมน้ำมันพรีเมียม ซูเปอร์พาวเวอร์ \n" +
                            "ทุก 600 บาท รับสิทธิ์ชิงโชค 2 เท่า\n"
                        , 14f)
                SunmiPrintHelper.getInstance().printTitle("จำนวน $promotionTotal สิทธิ์")
                SunmiPrintHelper.getInstance().printQr(linkQR, print_size, error_level)
                SunmiPrintHelper.getInstance().printTitle(qrText)
                SunmiPrintHelper.getInstance().setAlign(0)
                SunmiPrintHelper.getInstance().printWithSize("กติการ่วมลุ้นรางวัล\n" +
                        "1.รับคูปองชิงโชคท้ายใบเสร็จ เมื่อเติมน้ำมันชนิดใดก็ได้\n" +
                        "ครบทุก 600 บาท ตามเงื่อนไขรายการ\n" +
                        "2.ลงทะเบียนได้ตั้งแต่วันที่ 1 พ.ย. 65 - 31 ม.ค. 66\n" +
                        "3.เพียงสแกนคิวอาร์โค้ดนี้และกรอกข้อมูลให้ครบถ้วน\n" +
                        "เพื่อรับสิทธิ์ลุ้นรางวัลกับสถานีบริการ พีทีที สเตชั่น\n" +
                        "4.ลุ้น 432 รางวัล รวมมูลค่ากว่า 14 ล้านบาท\n" +
                        "5.จำกัดการรับสิทธิ์ชิงโชคสูงสุด 20 สิทธิ์/ใบเสร็จ\n" +
                        "6.จับรางวัล 2 ครั้ง ในวันที่ 20 ธ.ค. 65 และ 20 ก.พ. 66\n" +
                        "7.ประกาศรายชื่อผู้โชคดี 2 ครั้ง ในวันที่ 22 ธ.ค. 65\n" +
                        "และ 22 ก.พ. 66\n" +
                        "8.มอบของรางวัล 1 ครั้ง ในวันที่ 8 มี.ค. 66\n" +
                        "9.ติดตามการประกาศรายชื่อผู้โชคดีได้ที่\n" +
                        "https://pttstationluckydraw.pttor.com\n" +
                        "10.หากไม่สามารถสแกนคิวอาร์โค้ดได้ ลงทะเบียนได้ที่\n" +
                        "https://pttstationluckydraw.pttor.com\n" +
                        "11.บริษัทฯ ขอสงวนสิทธิ์สำหรับลูกค้าที่มีที่อยู่ถิ่นฐาน\n" +
                        "ในประเทศไทยเท่านั้น\n" +
                        "12.เงื่อนไขเป็นไปตามที่บริษัทฯ กำหนด\n" +
                        "13.ศึกษารายละเอียดเพิ่มเติม www.pttor.com หรือ\n" +
                        "โทร. 1365 Contact Center", 14f)


                SunmiPrintHelper.getInstance().feedPaper()
            }
        }
    }

    fun getQRCode(promotionId: String, promotionTotal: String, sCode: String, ): Pair<String, String> {
        if (promotionTotal.length > 2) return Pair("","")
        val domain_uat = "https://posoillucktest.pttor.com/Register?data="
        val domain_prod = "https://pttstationluckydraw.pttor.com/Register?data="
        val domain = domain_prod

        var qrCode = ""
        var qrcodeText = ""
        val data = StringBuilder()
        var stationCode = sCode
        when (stationCode.length) {
            1 -> stationCode = "00000"+stationCode
            2 -> stationCode = "0000"+stationCode
            3 -> stationCode = "000"+stationCode
            4 -> stationCode = "00"+stationCode
            5 -> stationCode = "0"+stationCode
            else -> stationCode
        }
        data.append(stationCode)
        data.append(promotionId)
        data.append("0")//station_status
        val random = getPromotionRunning()
        data.append(random)//promotion running random
        data.append(promotionTotal)
        val result = EncryptPromotionCode().getEncryptData(data.toString())
        if (result.resultCode == 0) {
            qrcodeText = result.resultEncryptData.qrcodeText
            qrCode = result.resultEncryptData.qrcode
        }
        return Pair(domain+qrCode, qrcodeText)
    }

    private fun getPromotionRunning(): String {
        val charPool : List<Char> = ('A'..'Z') + ('2'..'9')
        val STRING_LENGTH = 4
        val randomString = (1..STRING_LENGTH)
            .map { i -> kotlin.random.Random.nextInt(0, charPool.size) }
            .map(charPool::get)
            .joinToString("");
        return randomString
    }

    private fun getStationName(code: String): String {
        val data = mapOf("2002" to "สถานีบริการ ปตท.สาขาอยุธยา - เอเชีย ไฮเวย์ (กม.55)"
            ,"2003" to "สถานีบริการ ปตท.สาขาอยุธยา - เอเชีย ไฮเวย์ (กม.98)"
            ,"2004" to "สถานีบริการ ปตท.สาขาอยุธยา - บิ๊กคิง"
            ,"2005" to "สถานีบริการ ปตท.สาขาอยุธยา - เอเชีย ไฮเวย์ (กม.89)"
            ,"2006" to "สถานีบริการ ปตท.สาขาอยุธยา - วังน้อย (กม.57)"
            ,"2007" to "สถานีบริการ ปตท.สาขาอยุธยา - เอเชีย (กม.51)"
            ,"2008" to "สถานีบริการ ปตท.สาขาอยุธยา - เอเชีย (กม.62)"
            ,"2009" to "สถานีบริการ ปตท. สาขาอยุธยา - ทล.1 กม.56 ขาเข้า"
            ,"3002" to "สถานีบริการ ปตท.สาขากรุงเทพ - สุขาภิบาล 1 (ตะวันตก)"
            ,"3004" to "สถานีบริการ ปตท.สาขากรุงเทพ - สุขาภิบาล 3"
            ,"3006" to "สถานีบริการ ปตท.สาขากรุงเทพ-รามอินทรา 1"
            ,"3007" to "สถานีบริการ ปตท.สาขากรุงเทพ - สุวินทวงศ์ (ขาออก)"
            ,"3008" to "สถานีบริการ ปตท.สาขากรุงเทพ - เพชรเกษม 46"
            ,"3009" to "สถานีบริการ ปตท.สาขากรุงเทพ - สุขาภิบาล 3 (ขาเข้า)"
            ,"3010" to "สถานีบริการ ปตท.สาขากรุงเทพ - พระราม 2 (กม.7)"
            ,"3011" to "สถานีบริการ ปตท.สาขากรุงเทพ - บางแค (วงแหวน)"
            ,"3012" to "สถานีบริการ ปตท.สาขากรุงเทพ - พระราม 2 (กม.14)"
            ,"3013" to "สถานีบริการ ปตท.สาขากรุงเทพ - พระราม 2 (กม.5 บางมด)"
            ,"3014" to "สถานีบริการ ปตท.สาขากรุงเทพ - สุวินทวงศ์ (ขาเข้า)"
            ,"3015" to "สถานีบริการ ปตท.สาขากรุงเทพ - รามอินทรา 2 "
            ,"3016" to "สถานีบริการ ปตท.สาขากรุงเทพ - วงแหวน (แมคโคร)"
            ,"3017" to "สถานีบริการ ปตท.สาขากรุงเทพ - วิภาวดี เซียร์ (กม.27)"
            ,"3018" to "สถานีบริการ ปตท.สาขากรุงเทพ - ศรีนครินทร์ (กม.10)"
            ,"3019" to "สถานีบริการ ปตท.สาขากรุงเทพ - บางแค 2 (วงแหวน)"
            ,"3020" to "สถานีบริการ ปตท.สาขากรุงเทพ - รามอินทรา (กม.14)"
            ,"3021" to "สถานีบริการ ปตท.สาขากรุงเทพฯ - สาทร - ตากสิน 1"
            ,"3022" to "สถานีบริการ ปตท.สาขากรุงเทพฯ - สาทร - ตากสิน 2"
            ,"3023" to "สถานีบริการ ปตท.สาขากรุงเทพ - พหลโยธิน (กม.27)"
            ,"3024" to "สถานีบริการ ปตท.สาขากรุงเทพ - สุวินทวงศ์ กม.36 (ขาเข้า)"
            ,"5001" to "สถานีบริการ ปตท.สาขาฉะเชิงเทรา - บางปะกง 1"
            ,"5002" to "สถานีบริการ ปตท.สาขาฉะเชิงเทรา - บางปะกง 2"
            ,"5003" to "สถานีบริการ ปตท.สาขาฉะเชิงเทรา - บางนา ตราด (กม.49)"
            ,"5004" to "สถานีบริการ ปตท.สาขาฉะเชิงเทรา - บางนา ตราด (กม.41)"
            ,"5005" to "สถานีบริการ ปตท.สาขาฉะเชิงเทรา - บางนา ตราด (กม.37)"
            ,"5006" to "สถานีบริการ ปตท.สาขาฉะเชิงเทรา - บางปะกง 3"
            ,"5007" to "สถานีบริการ ปตท.สาขาฉะเชิงเทรา - บางไผ่"
            ,"5008" to "สถานีบริการ ปตท.สาขาฉะเชิงเทรา - บางคล้า"
            ,"5010" to "สถานีบริการ ปตท.สาขาฉะเชิงเทรา - เขาหินซ้อน (กม.50)"
            ,"5011" to "สถานีบริการ ปตท.สาขาฉะเชิงเทรา - เขาหินซ้อน (กม.54)"
            ,"5012" to "สถานีบริการ ปตท. สาขาฉะเชิงเทรา - นิคมฯ เกตเวย์ (ขาออก)"
            ,"7001" to "สถานีบริการ ปตท.สาขาชัยภูมิ - ทล.201 กม.118 ขาเข้า"
            ,"9001" to "สถานีบริการ ปตท.สาขาเชียงใหม่ - แอร์พอร์ต 1"
            ,"9002" to "สถานีบริการ ปตท.สาขาเชียงใหม่ - ไฮเวย์"
            ,"9003" to "สถานีบริการ ปตท.สาขาเชียงใหม่ - แม่ริม 1"
            ,"9004" to "สถานีบริการ ปตท.สาขาเชียงใหม่ - แม่โจ้"
            ,"9005" to "สถานีบริการ ปตท.สาขาเชียงใหม่ - ธรรมศาสตร์"
            ,"9009" to "สถานีบริการ ปตท.สาขาเชียงใหม่ - แอร์พอร์ต 2"
            ,"9012" to "สถานีบริการ ปตท.สาขาเชียงใหม่ - แม่โจ้ 2"
            ,"11001" to "สถานีบริการ ปตท.สาขาชลบุรี - บ้านบึง 1"
            ,"11002" to "สถานีบริการ ปตท.สาขาชลบุรี - บางแสน (อ่างศิลา)"
            ,"11003" to "สถานีบริการ ปตท.สาขาชลบุรี - พัทยา (มินิสยาม)"
            ,"11004" to "สถานีบริการ ปตท.สาขาชลบุรี - พัทยา (กลาง)"
            ,"11005" to "สถานีบริการ ปตท.สาขาชลบุรี - บางแสน (แมคโคร)"
            ,"11006" to "สถานีบริการ ปตท.สาขาชลบุรี - ศรีราชา (แหลมทอง)"
            ,"11010" to "สถานีบริการ ปตท.สาขาชลบุรี - ศรีราชา (บางพระ)"
            ,"11011" to "สถานีบริการ ปตท.สาขาชลบุรี - บ้านบึง 2"
            ,"11012" to "สถานีบริการ ปตท.สาขาชลบุรี - บายพาส 2"
            ,"11014" to "สถานีบริการ ปตท.สาขาชลบุรี - บายพาส 3"
            ,"11015" to "สถานีบริการ ปตท.สาขาชลบุรี - พัทยา (โลตัส)"
            ,"11016" to "สถานีบริการ ปตท.สาขาชลบุรี - บายพาส 4"
            ,"11017" to "สถานีบริการ ปตท.สาขาชลบุรี - ศรีราชา (แหลมฉบัง)"
            ,"11018" to "สถานีบริการ ปตท.สาขาชลบุรี - หนองมน"
            ,"11019" to "สถานีบริการ ปตท.สาขาชลบุรี - บางทราย"
            ,"11020" to "สถานีบริการ ปตท.สาขาชลบุรี - ศรีราชา (อ่าวอุดม)"
            ,"11021" to "สถานีบริการ ปตท.สาขาชลบุรี - พนัสนิคม 1"
            ,"11022" to "สถานีบริการ ปตท.สาขาชลบุรี - พนัสนิคม 2 (ขาออก)"
            ,"11023" to "สถานีบริการ ปตท.สาขาชลบุรี - บ้านบึง 3"
            ,"11024" to "สถานีบริการ ปตท.สาขาชลบุรี - บ้านบึง 4"
            ,"11025" to "สถานีบริการ ปตท.สาขาชลบุรี - พนัสนิคม 3 กม.38 (ขาออก)"
            ,"11027" to "สถานีบริการ ปตท.สาขาชลบุรี - ทล.36 กม.14 (ขาเข้า)"
            ,"11028" to "สถานีบริการ ปตท. สาขาชลบุรี - ทล.3 กม.131 ขาเข้า"
            ,"11029" to "สถานีบริการ ปตท.สาขาชลบุรี - พนัสนิคม 4"
            ,"16001" to "สถานีบริการ ปตท.สาขาขอนแก่น - มิตรภาพ"
            ,"16002" to "สถานีบริการ ปตท.สาขาขอนแก่น - มะลิวัลย์ 1"
            ,"16003" to "สถานีบริการ ปตท.สาขาขอนแก่น - ศรีจันทร์"
            ,"16004" to "สถานีบริการ ปตท.สาขาขอนแก่น - ประชาสโมสร"
            ,"16005" to "สถานีบริการ ปตท.สาขาขอนแก่น - มะลิวัลย์ 2"
            ,"21001" to "สถานีบริการ ปตท.สาขาลพบุรี - ท่าศาลา"
            ,"21002" to "สถานีบริการ ปตท.สาขาลพบุรี - ทะเลชุบศร"
            ,"21003" to "สถานีบริการ ปตท.สาขาลพบุรี - นิคม"
            ,"21004" to "สถานีบริการ ปตท.สาขาลพบุรี - ท่าวุ้ง"
            ,"26006" to "สถานีบริการ ปตท.สาขานครปฐม - เพชรเกษม (กม.30)"
            ,"26007" to "สถานีบริการ ปตท.สาขานครปฐม - ปิ่นเกล้า (กม.26)"
            ,"26008" to "สถานีบริการ ปตท.สาขานครปฐม - ลำพญา 2"
            ,"26009" to "สถานีบริการ ปตท.สาขานครปฐม - เพชรเกษม กม.67 (ขาเข้า)"
            ,"28004" to "สถานีบริการ ปตท.สาขาโคราช - จอหอ"
            ,"28005" to "สถานีบริการ ปตท.สาขาโคราช - ปากช่อง (กม.157)"
            ,"28006" to "สถานีบริการ ปตท.สาขาโคราช - สีคิ้ว"
            ,"28007" to "สถานีบริการ ปตท.สาขาโคราช - สูงเนิน กม.27"
            ,"34004" to "สถานีบริการ ปตท.สาขานนทบุรี - ติวานนท์"
            ,"34006" to "สถานีบริการ ปตท.สาขานนทบุรี - รัตนาธิเบศร์ 2"
            ,"34007" to "สถานีบริการ ปตท.สาขาบางบัวทอง - สุพรรณบุรี กม.28"
            ,"34008" to "สถานีบริการ ปตท.สาขานนทบุรี - วงแหวน (บางใหญ่)"
            ,"34009" to "สถานีบริการ ปตท.สาขานนทบุรี - สุพรรณ (กม.30)"
            ,"34010" to "สถานีบริการ ปตท.สาขานนทบุรี - วงแหวน (กม.40 คาร์ฟูร์)"
            ,"34011" to "สถานีบริการ ปตท.สาขานนทบุรี - บิ๊กซี"
            ,"34012" to "สถานีบริการ ปตท.สาขานนทบุรี - ชัยพฤกษ์"
            ,"34013" to "สถานีบริการ ปตท.สาขานนทบุรี - วงแหวน ตะวันตก กม.51 ขาออก"
            ,"34014" to "สถานีบริการ ปตท.สาขานนทบุรี - บางกรวย ไทรน้อย (ขาออก)"
            ,"35001" to "สถานีบริการ ปตท.สาขาปทุมธานี - รังสิต (คลอง2)"
            ,"35003" to "สถานีบริการ ปตท.สาขาปทุมธานี - บางพูน 1"
            ,"35004" to "สถานีบริการ ปตท.สาขาปทุมธานี - ลำลูกกา 1"
            ,"35006" to "สถานีบริการ ปตท.สาขาปทุมธานี - รังสิต (คลอง7)"
            ,"35007" to "สถานีบริการ ปตท.สาขาปทุมธานี - ลำลูกกา 2 (วัดสายไหม)"
            ,"35008" to "สถานีบริการ ปตท.สาขาปทุมธานี - ไพน์เฮริสท์"
            ,"35009" to "สถานีบริการ ปตท.สาขาปทุมธานี - ธรรมศาสตร์ (รังสิต)"
            ,"35010" to "สถานีบริการ ปตท.สาขาปทุมธานี - พหลโยธิน (กม.30 เซียร์)"
            ,"35011" to "สถานีบริการ ปตท.สาขาปทุมธานี - บางพูน 2 (กม.7)"
            ,"35012" to "สถานีบริการ ปตท.สาขาปทุมธานี - ลำลูกกา 3"
            ,"35013" to "สถานีบริการ ปตท.สาขาวงแหวนตะวันตก - สามโคก ขาออก (กม.70)"
            ,"35014" to "สถานีบริการ ปตท.สาขาปทุมธานี - ลำลูกกา 4"
            ,"35015" to "สถานีบริการ ปตท.สาขาปทุมธานี - ลาดหลุมแก้ว กม.26"
            ,"35016" to "สถานีบริการ ปตท.สาขาปทุมธานี - ลำลูกกา 5 (โฮมโปร)"
            ,"35017" to "สถานีบริการ ปตท.สาขาปทุมธานี - ทางหลวง 346 กม.12"
            ,"41001" to "สถานีบริการ ปตท.สาขาเพชรบุรี - บ้านลาด (กม.173)"
            ,"41002" to "สถานีบริการ ปตท.สาขาเพชรบุรี - หัวสะพาน (กม.153)"
            ,"42001" to "สถานีบริการ ปตท.สาขาพิจิตร - ดงเจริญ"
            ,"42002" to "สถานีบริการ ปตท.สาขาพิจิตร - ทับคล้อ"
            ,"43001" to "สถานีบริการ ปตท.สาขาพิษณุโลก - โคกช้าง"
            ,"46001" to "สถานีบริการ ปตท. สาขาปราจีนบุรี - คลองรั้ง"
            ,"49001" to "สถานีบริการ ปตท.สาขาราชบุรี - บ้านโป่ง"
            ,"49003" to "สถานีบริการ ปตท.สาขาราชบุรี - เพชรเกษม (กม.95)"
            ,"49004" to "สถานีบริการ ปตท.สาขาราชบุรี - เพชรเกษม กม.89"
            ,"50003" to "สถานีบริการ ปตท.สาขาระยอง - สุขุมวิท 2"
            ,"50005" to "สถานีบริการ ปตท.สาขาระยอง - สุขุมวิท 4"
            ,"50006" to "สถานีบริการ ปตท.สาขาระยอง - แกลง"
            ,"50007" to "สถานีบริการ ปตท.สาขาระยอง - สุขุมวิท กม.212 ขาเข้า"
            ,"50008" to "สถานีบริการ ปตท. สาขาระยอง - บ้านฉาง กม.192 ขาเข้า"
            ,"53001" to "สถานีบริการ ปตท.สาขาสมุทรปราการ - เทพารักษ์"
            ,"53003" to "สถานีบริการ ปตท.สาขาสมุทรปราการ - ฟาร์มจรเข้"
            ,"53004" to "สถานีบริการ ปตท.สาขาสมุทรปราการ - บางนา ตราด (กม.25)"
            ,"53005" to "สถานีบริการ ปตท.สาขาสมุทรปราการ - บางนา ตราด (กม.27)"
            ,"53006" to "สถานีบริการ ปตท.สาขาสมุทรปราการ - บางนา ตราด (กม.17)"
            ,"53007" to "สถานีบริการ ปตท.สาขาสมุทรปราการ - นาวี"
            ,"53008" to "สถานีบริการ ปตท.สาขาสมุทรปราการ - ศรีนครินทร์ 2"
            ,"54001" to "สถานีบริการ ปตท.สาขาสมุทรสาคร - เศรษฐกิจ (อ้อมน้อย 1)"
            ,"54002" to "สถานีบริการ ปตท.สาขาสมุทรสาคร - เศรษฐกิจ (อ้อมน้อย 2)"
            ,"54003" to "สถานีบริการ ปตท.สาขาสมุทรสาคร - พระราม 2 (กม.25)"
            ,"54004" to "สถานีบริการ ปตท.สาขาสมุทรสาคร - พระราม 2 (กม.35)"
            ,"54005" to "สถานีบริการ ปตท.สาขาสมุทรสาคร - พระราม 2 (กม.43)"
            ,"54006" to "สถานีบริการ ปตท.สาขาสมุทรสาคร - พระราม 2 กม.35 (ส่วนขยาย)"
            ,"56001" to "สถานีบริการ ปตท.สาขาสระบุรี - ดาวเรือง"
            ,"56002" to "สถานีบริการ ปตท.สาขาสระบุรี - แก่งคอย 1"
            ,"56003" to "สถานีบริการ ปตท.สาขาสระบุรี - แก่งคอย 2"
            ,"56004" to "สถานีบริการ ปตท.สาขาสระบุรี - หินกอง"
            ,"56005" to "สถานีบริการ ปตท.สาขาสระบุรี - พุแค"
            ,"58002" to "สถานีบริการ ปตท.สาขาสิงห์บุรี - อินทร์บุรี กม.104 (ขาเข้า)"
            ,"58003" to "สถานีบริการ ปตท.สาขาสิงห์บุรี - เอเชีย ไฮเวย์ กม.90 (ขาออก)"
            ,"59001" to "สถานีบริการ ปตท.สาขาสระแก้ว ทล.359 กม.54 ขาออก"
            ,"59002" to "สถานีบริการ ปตท.สาขาสระแก้ว ทล.359 กม.60 ขาเข้า"
            ,"66001" to "สถานีบริการ ปตท.สาขาตาก - พหลโยธิน กม.524 ขาออก"
            ,"70001" to "สถานีบริการ ปตท.สาขาอุดรธานี - อุดรดุษฏี (กม.121)"
            ,"70002" to "สถานีบริการ ปตท.สาขาอุดรธานี - ขอนแก่น (กม.111)"
            ,"70003" to "สถานีบริการ ปตท.สาขาอุดรธานี โนนสะอาด กม.403 ขาเข้า"
            ,"70004" to "สถานีบริการ ปตท.สาขาอุดรธานี นาข่า กม.470 ขาเข้า")
        return data.get(code)!!
    }
}